var myObject = {
  name: "<p>المعز لدين الله الفاطمي</p>",
  Birth: "<p>وُلد المعز لدين الله الفاطمي في مدينة المهدية، في عام 319 هـ</p>",
  hisLife: `<p>أدرك المعز لدين الله ثلاثة من الخلفاء 
  الفاطميين وهم؛ المهدي، والقائم، ووالده المنصور، وتربى المعز لدين الله في قصور المهدية، وقد نال علمه وثقافته في جزيرة صقلية،
  ويُجدر بالذكر أنه كان المعز لدين الله من الرجال الذين ذكرهم التاريخ لما كان يتصف به من الحكمة، والعطف، وطيبة القلب،
  وغيرها من الصفات الحميدة. رُزق المعز لدين الله بأربعة أولاد وهم
  ؛ تميم الشاعر، وعبدالله، وعُقيل، والعزيز، فضلًا عن إنجابه لابنتين وهما؛
  رشيدة، وعبدة، وتُوفيّ الخليفة المعز لدين الله الفاطمي رابع الخلفاء الفاطميين،
  والمؤسس للدولة الفاطمية في مدينة القاهرة، في 16 من ربيع الآخر لعام 365 هـ.</p>`,
  His_position: `<p>ولى المعز لدين الله الخلافة الفاطمية خلفًا لأبيه المنصور أبي طاهر إسماعيل، الخليفة الثالث في قائمة الخلفاء الفاطميين، وكان المعز رجلًا مثقفًا يجيد عدة لغات مولعًا بالعلوم والآداب متمرسًا بإدارة شئون الدولة وتصريف أمورها كيسًا فطنًا يحظى باحترام رجال الدولة وتقديرهم.

وانتهج المعز سياسة رشيدة، فأصلح ما أفسدته ثورات الخارجين على الدولة، ونجح في بناء جيش قوي، واصطناع القادة والفاتحين وتوحيد بلاد المغرب تحت رايته وسلطانه ومد نفوذه إلى جنوب إيطاليا.

ولم تغفل عينا المعز لدين الله عن مصر، فكان يتابع أخبارها، وينتظر الفرصة السانحة لكي يبسط نفوذه عليها، متذرعًا بالصبر وحسن الإعداد، حتى يتهيأ له النجاح والظفر.</p>`,
  dith: `<p>توفي حين كان عمره 46 عامًا</p>`,
};

document.getElementById("The_person").innerHTML =

  "<h2> الاسم</h2>"  + myObject.name + "<br>" +
  "<h2>ميلاده</h2>" + myObject.Birth + "<br>" +
  "<h2>حياته</h2>" + myObject.hisLife + "<br>" +
  "<h2>حكمه</h2>" + myObject.His_position + "<br>" +
  "<h2>وفاته</h2>" + myObject.dith ;
