var myObject = {
  name: "<p>الملك الظاهر ركن الدين بيبرس البندقداري.</p>",
  Birth: `<p>وُلد **بيبرس** حوالي عام **1223م**، ويعتقد أن مولده كان في منطقة **القوقاز** أو في إحدى مناطق **بلاد ما وراء النهر** (التي تضم جزءًا من دول مثل جورجيا وأرمينيا). وكان من أصل شراكسي، ثم أُسر أثناء الحروب المغولية وبيعه كعبد في مصر حيث أصبح مملوكًا.</p>`,
  hisLife: `<p>في وقتٍ مبكر من حياته، أسره المغول في إحدى غزواتهم، وتم بيعه كعبد في سوق العبيد في مصر. بدأ حياته كعبد مملوك، حيث اشتراه أحد القادة العسكريين في مصر، ولكنه سرعان ما أظهر كفاءته وبراعته العسكرية.

عندما تم دمجه في الجيش الأيوبي تحت قيادة السلطان الصالح نجم الدين أيوب، بدأ بيبرس في ترقيته السريعة بفضل مهاراته القتالية العالية وذكائه الحربي. شارك في عدة معارك هامة ضد المغول والصليبيين، وبرز بشكل خاص في معركة عين جالوت عام 1260م ضد المغول، حيث كان له دور حاسم في هزيمتهم وإنقاذ العالم الإسلامي من غزوهم.

بعد عدة سنوات من خدمته كقائد مملوك، وصل بيبرس إلى الحكم. وفي عام 1260م، بعد سقوط آخر حكام الأيوبيين، أصبح السلطان الظاهر بيبرس. تحت حكمه، عمل على تحقيق العديد من الإصلاحات في الجيش والإدارة، وأسهم في تعزيز قوة الدولة المملوكية. سعى بيبرس لتوسيع رقعة أراضيه، وقاد العديد من الحملات العسكرية الناجحة ضد الصليبيين، فاستطاع طردهم من بعض مدن الشام وأبرزها عكا.

بيبرس كان يعرف بخططه العسكرية المحكمة وبراعته في بناء وتطوير الجيش المملوكي، وهو ما مكنه من بسط السيطرة على مصر والشام بشكل أكبر. كما اهتم بالشؤون الاقتصادية والاجتماعية في مصر، وعمل على تحسين النظام الإداري هناك. كان له دور بارز في تطوير معالم القاهرة والشرق الأوسط الإسلامي، وأسهم في تشييد القلاع والحصون التي ساعدت في تعزيز أمن الدولة المملوكية.</p>`,

  dith: `<p>توفي بيبرس عام 1277م، بعد فترة حكم استمرت أكثر من عشر سنوات، ولكنه ترك إرثًا كبيرًا في التاريخ الإسلامي والعسكري. تُعتبر فترة حكمه نقطة تحول في قوة الدولة المملوكية، وهو يعد اليوم من أبرز القادة العسكريين في العالم الإسلامي.</p>`,
};

document.getElementById("The_person").innerHTML =

  "<h2> الاسم</h2>"  + myObject.name + "<br>" +
  "<h2>ميلاده</h2>" + myObject.Birth + "<br>" +
  "<h2>حياته</h2>" + myObject.hisLife + "<br>" +
  "<h2>وفاته</h2>" + myObject.dith ;
