var myObject = {
  name: "<p> محمد علي بن إبراهيم بن عبد الله.</p>",
  Birth: `<p>وُلد **بيبرس** حوالي عام **1223م**، ويعتقد أن مولده كان في منطقة **القوقاز** أو في إحدى مناطق **بلاد ما وراء النهر** (التي تضم جزءًا من دول مثل جورجيا وأرمينيا). وكان من أصل شراكسي، ثم أُسر أثناء الحروب المغولية وبيعه كعبد في مصر حيث أصبح مملوكًا.</p>`,
  hisLife: `<p>انتقل محمد علي إلى مصر في بداية القرن التاسع عشر ضمن وفد من الجنود العثمانيين المشاركين في الحملات ضد الفرنسيين بقيادة نابليون بونابرت. ورغم بدايته كجزء من القوات العثمانية، إلا أن الفراغ السياسي والعسكري في مصر مع انهيار الحكم الفرنسي مهد له الفرصة ليتسلق سلّم السلطة. ففي عام 1805، تم تعيينه واليًا على مصر من قبل السلطان العثماني، ولكنه لم يقبل هذه السلطة بسكون. بل بدأ يعد العدة للهيمنة على مصر وبقية أراضي المنطقة.

كانت بداية حكمه في مصر محفوفة بالتحديات. فكان عليه أولاً أن يتعامل مع القوة العسكرية للمماليك الذين ظلوا يشكلون تهديدًا، ونجح في القضاء عليهم في مذبحة القلعة عام 1811، والتي كانت بداية انفراده بالسلطة. بفضل استراتيجيته العسكرية الذكية وشخصيته القوية، نجح محمد علي في فرض نفسه كحاكم لمصر والسيطرة على أهم مدنها.

أحد أبرز أبعاد حكم محمد علي كان اهتمامه الكبير بالإصلاحات العسكرية والاقتصادية. فقد سعى إلى تحديث الجيش المصري ليصبح قوة نظامية قائمة على التدريب الحديث والتكنولوجيا العسكرية، فاستقدم مستشارين عسكريين من أوروبا واهتم بتطوير القوات البحرية والمصانع العسكرية. كانت هذه الإصلاحات أساسية في تحقيق استقرار حكمه والتوسع في الأراضي المجاورة.

كما بادر بالعديد من الإصلاحات الاقتصادية التي شملت إدخال زراعة محاصيل جديدة وتحفيز الأنشطة الصناعية المحلية. وأرسى نظامًا زراعيًا يعتمد على الزراعة المدعومة والموارد الطبيعية التي أتاحها نهر النيل. وقد خطط محمد علي لمشروعات صناعية وسعى إلى تحقيق الاكتفاء الذاتي لمصر، حيث أسس مصانع مختلفة بما فيها مصانع الأسلحة.

ومع اتساع نفوذه داخل مصر وخارجها، خاض محمد علي سلسلة من الحروب ضد القوى العثمانية والمماليك في الشام والحجاز والسودان. قام بالعديد من الحملات العسكرية الناجحة، كان أبرزها حملاته في الشام حيث دخل معارك شرسة ضد العثمانيين وحافظ على نفوذه في تلك المنطقة. إضافة إلى ذلك، بسط سيطرته على السودان ليؤمن منابع النيل.

كانت علاقاته مع الدولة العثمانية متقلبة. ففي البداية كان حليفًا للعثمانيين، ولكن سرعان ما تطورت التوترات بينهم بسبب طموحاته السياسية. ففي عام 1831، وبعد سلسلة من المعارك مع العثمانيين، أصبح محمد علي ينافس الدولة العثمانية على السلطة الإقليمية. وتزايدت ضغوطه على السلطنة العثمانية لدرجة أنه كان يسعى لاستقلال مصر التام. على الرغم من أن التدخل الأوروبي وضع حداً لطموحاته بخصوص الاستقلال التام، فقد تمكن من ترسيخ حكم أسرته لعدة عقود.</p>`,

  dith: `<p>توفي محمد علي في 2 أغسطس 1849، بعد 44 عامًا من الحكم. ومن بعده تولى ابنه إبراهيم باشا حكم مصر لفترة قصيرة، ثم خلفه ابنه عباس الأول. رغم أن حكمه شهد عددًا من التحديات السياسية والعسكرية، فإن إرثه يمتد إلى يومنا هذا، ويعد مؤسس مصر الحديثة بفضل إصلاحاته وبنيته السياسية والعسكرية التي أثرت على شكل الدولة لفترة طويلة.</p>`,
};

document.getElementById("The_person").innerHTML =

  "<h2> الاسم</h2>"  + myObject.name + "<br>" +
  "<h2>ميلاده</h2>" + myObject.Birth + "<br>" +
  "<h2>حياته</h2>" + myObject.hisLife + "<br>" +
  "<h2>وفاته</h2>" + myObject.dith ;
