var myObject = {
  name: "<p>صلاح الدين الايوبي</p>",
  Birth: "<p>وُلِدَ صلاح الدين في تكريت في العراق عام 532 هـ/1138م في ليلة مغادرة والده نجم الدين أيوب قلعة تكريت حينما كان واليًا عليها</p>",
  Jerusalem: `<p>حقّق صلاح الدين الأيوبي حلم نور الدين زنكي في استعادة القدس من الفرنجة وإعادتها إلى قبضة المسلمين؛
  فقد كان هذا الحلم هو الهدف الأسمى لنور الدين والذي من أجله حُشدت الجيوش الإسلاميّة في كل من العراق وسوريا وفلسطين ومصر،
  إلّا أنّه لم يتمكّن من رؤية حلمه واقعًا بسبب وفاته عام 1174 م، فاستلم صلاح الدين المهمّة النبيلة،
  ليُحقّق حلم نور الدين وجميع المسلمين، وكانت مهمّة تحرير القدس هي المهمّة التي دونها كل دماء المسلمين،
  وبها يتجسّد الانتصار العظيم على الفرنجة؛ ففتح القدس وتحريرها هو من أبرز نتائج معركة حطين عام 1187 م بين المسلمين والصليبيين الفرنجة،
  والتي جرت أحداثها في حطين الواقعة في فلسطين، ومن نتائجها أيضًا:
  أسر ملك القدس، غي دي لوزينيان. أسر الأمير رينو دو شاتيون وقتله على يد صلاح الدين. فداء مئات الأسرى من الجيش الصليبي. بيع الأسرى ممن لم يُفتدَ في أسواق الرقيق. تقديم الحماية والأمان لأهل القدس عند دخولها.
  منع صلاح الدين المسلمين من التعرّض لممتلكات الصليبيين عند دخول القدس.
  ظهر نُبل صلاح الدين في تعامله مع الصليبين المتواجدين داخل مدينة بيت المقدس بعد معركة حطين ودخول المدينة فلم يتعرّض جنوده للسكّان بأيّ أذىً،
  بل أمّنهم على أرواحهم وممتلكاتهم وحماهم أيضًا حتى بلوغهم صور، وهذه المعاملة هي النقيض تمامًا لما أظهره الصليبيين من معاملة قاسية لأهالي القدس أثناء فترة حكمهم،
  ثمّ تَبِع ذلك الحملة الصليبية الثالثة التي أُقيمت بهدف احتلال أراضي المسلمين والقدس من جديد،
  بقيادة ريتشارد الأوّل ملك إنجلترا الملقّب بقلب الأسد، وبالفعل سيطر على العديد من أراضي المسلمين، ولكنّ صلاح الدين استطاع التفاوض معه للاستمرار بحكم القدس وبقائها في حوزة المسلمين.</h2>`,
  dith: `<p>خرج صلاح الدين الأيوبي لملاقاة الحجاج العائدين من مكة المكرمة في 14/صفر عام 589هـ،
  وبعد عودته من هذا الاستقبال أصيب بالحمّى الصفراوية، واشتدّ عليه المرض وتزايد تدريجياً، حتى أصبحت حالته خطيرة وعجز الأطباء عن علاجه،
  وفي يوم الأربعاء في 27 صفر عام589هـ ازدادت حالته خطورةً، ودخل في غيبوبة طويلة لم يفق منها إلا قليلاً، وبعد صلاة الصبح من ذات اليوم أسلم الروح لبارئها وفارق الحياة  </P>`,

};

// تحويل الكائن إلى نص وعرضه في الـdiv
document.getElementById("salahElden").innerHTML =

  "<h2> الاسم:</h2>"  + myObject.name + "<br>" +
  "<h2>ميلاده: </h2>" + myObject.Birth + "<br>" +
  "<h2>صلاح الدين و القدس: </h2>" + myObject.Jerusalem + "<br>" +
  "<h2>وفاته</h2>" + myObject.dith ;
